[
  {
    "title": "Developer",
    "salary": "£50,000 - £60,000 per annum",
    "location": "Greenford\n                    Middlesex",
    "remote": "Work from home",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Developer, C#, JavaScript  Salary & benefits: £50 to £60K, Pension, Private Health, etc. A leading global tech company is looking for a Mid-Level C# Developer due to continued growth and demand for their products. You will join a small but growing team of highly skilled Developers and will be mentored by the Enterprise Architect. He will share  his experiences and technical know-how to bring you up to speed - as they truly offer a collaborative environment. You don’t need to have all the technical answers, but you do need to be inquisitive and have an interest in upskilling. As they invest in their people and will provide you with extensive training opportunities. You will play an integral role in a number of high-profile projects: re-engineering their business systems, new systems implementations, process improvement, data and reporting related upgrades, and sales/order system improvements etc. Skills & experience;   Proven C# and JavaScript experience are essentialExperience working in Scrum environments, they hold daily remote stand-up meetingsExperience with a combination of the following; React, Azure DevOps, MSTEST, MOQExperience with either Dynamics 365 or the Power Platform is desirable. This is a fantastic opportunity to join a very supportive and rewarding organisation at an exciting time of growth across the business. If you are interested, please click the \"apply now\" button. Add me on LinkedIn to stay up to date with new opportunities! Search \"Johnny Perrotta\" and you will easily find me. Nufuture Recruitment Ltd acts as an employment agency for permanent recruitment and an employment business for the supply of temporary workers. (C# Developer, Lead Developer, Senior Developer, Web Developer, C# Programmer, Lead Programmer, Senior Programmer, Web Programmer, C# Software Engineer, Lead Software Engineer, Senior Software Engineer, Web Software Engineer, Developer, Programmer, Software  Engineer, C#, JavaScript, Azure, Dynamics, Power Platform, MSTEST, MOQ) \n",
    "skills": "C#,JavaScript"
  },
  {
    "title": "Developer",
    "salary": "£40,000 - £60,000 per annum",
    "location": "Holborn\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply Now\n                    \n            \n    \n\n         Overview Here at reed.co.uk we believe the world should Love Mondays. This means connecting people with the right jobs and courses for them, and we’re leading the way. We’re looking for great people to help deliver these life-changing products… is that you? As a courses marketplace, we focus on connecting potential students with the right course, and offer a complete user experience from browsing through to purchase. We’re looking for a talented, enthusiastic and motivated Developer who wants to play an integral  part in shaping the future of our Courses proposition. So, if you’re ready to immerse yourself in a market-leading product and become part of a fun and lively team, this role is for you. As a Developer resource dedicated to our Courses business, you’ll be part of a strong and talented team, working on the development and delivery of improvements, new features, and entirely new products, by solving complex problems, and creating elegant technical  solutions to fulfil the requirements of our internal, and external users. The successful candidate will have a passion for collaborating with multidisciplinary product teams to uncover and solve user problems across our B2B and B2C products. We operate in an agile environment so we understand that ideas start small and need time to grow and develop, we create an environment that allows this to happen in an iterative way. We are all dedicated to making the product a success for both of our user  groups - our students, and our course providers. Key Responsibilities Reporting into our Development Team Lead, you will work within the Courses Product team.   You’ll be involved in all parts of the development process, from inception to delivery, helping to define items of work with the development team, define the acceptance criteria, and devise technical solutions  Be involved in the entire delivery of work items, including front-end, back-end, and data persistence  Maintain code quality by developing to our defined coding standards, and using static code analysis tools to tackle technical debt, and avoid potential bugs and vulnerabilities  Work with the development team lead, and architect to implement ingenious solutions to problems involving the introduction of new technology  Manage technical debt with the team  Be involved with pre-release regression testing, coordinated by the Quality Engineers in the team  Liaise with the wider department on work items, as well as improvements or bugs affecting the effectiveness of our products and services, including UX, UI, Quality Engineers, DBDs, Product Owners, Support, your fellow developers, and, just occasionally,  with Marketing  Be part of the release rota, taking on the role of Release Manager to coordinate, and release code to production  Be a supportive team player, and work collaboratively with your peers  Skills and Experience   Commercial experience in developing responsive web applications  C#, ASP.Net, MVC, Web API  HTML, CSS, JavaScript  T-SQL  Supporting code with unit tests  The use of dependency injection frameworks  Experience with Object Relational Mappers (ORMs)  Understanding, and application of the SOLID principles  Applied design patterns to common design problem  Familiar with agile methodologies (e.g. Scrum, Kanban)  Use of version control tools to manage source code  Ability to collaborate with other members of the development team on improvements and ideas  Highly desira\n",
    "skills": ""
  },
  {
    "title": "Developer",
    "salary": "£55,000 - £65,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Developer - C#, .Net, SQL, Angular - 65k Mid Level Application Developer / API Integration Developer / Software Developer - C#, .Net, SQL Server, WCF, Angular, AGILE/SCRUM. Permanent. London/Flexible with some remote working £65k +Bonus +Benefits Multi-national insurance company seeks a Mid Level Web Application Developer to play a key role in the development of API gateways for access to external services and/or access for 3rd parties to their systems for the placement of business via contemporary  digital platforms. You will play a key role in the Build, support and management of enterprise applications using C# / .Net, frameworks such as Angular.JS will be employed and data drawn from multiple sources including SQL Server environments. Working within the full life cycle  the Web Application Developer / API Integration Developer will work with architectural teams and, at times, business users and will be required to develop use cases from requirements and model these into high quality APIs within a small team. We are searching for a Web Application Developer / Software Developer who has been working in a full stack application development capacity within the full life cycle utilising C#, .Net, SQL Server, NoSQL. Experience working within the full lifecycle working  closely with architects and the business and demonstrable ability to develop use cases is preferred. Experience gained within Insurance environments highly beneficial although non-essential - we can consider experience from within any sector for this role.  Azure certification preferred although non-essential. This is an excellent opportunity for career progression, technical advancement and commercial reward for a technically astute and commercially aware individual. Global insurance company; City of London office location with flexible - 2 days a week from home.  \n",
    "skills": "C#-Angular-JavaScript"
  },
  {
    "title": "Java Developer",
    "salary": "£70,000 - £80,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Java Developer - FinTech Unicorn Start Up Salary up to £80K + Bonus + Full Benefits Package Senior Java Developer (AWS, Docker, Kubernetes, Java 11+ Microservices). A disruptive FinTech start-up that is growing from 300 - 500 employees requires a Java Developer to join them on a permanent basis. The role can be almost fully remote, but an office  visit 1 -2 days per month would be expected. There are on track to be a Unicorn Start-Up and specialise in bringing car finance solutions up to speed using the latest technology. The Java Developer will be working in the anti-fraud and financial crime team. Java Developer, you will:  Work on multiple greenfield builds utilising the latest tools and technologies.Write in-depth, high performance, distributed systems and scale on to Amazon Web Services.Work heavily with microservices in a data-heavy environment.Utilise containerisation tools such as docker and Kubernetes in a DevOps environment. You will be joining as a developer, having a major influence on the technical direction and architecture of their solutions, you will be able to hire Java Developers into the team and take a pivotal role in supporting more junior developers. The company  hires excellent talent across their three offices and have seen exponential growth over the last 6 years. They offer an exceptional package, up to £80K + bonus + pension, healthcare etc. They have an excellent reputation in the market and are used by some of the country's best car dealers. Apply now for immediate consideration for this excellent Java Developer opportunity! Understanding Recruitment is acting as an employment agency for this Java Developer vacancy. \n",
    "skills": ""
  },
  {
    "title": "Python Developer",
    "salary": "£55,000 - £75,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Python Developer London - Hybrid £55,000 - £75,000 + Benefits This Role Does Not Provide Sponsorship OVERVIEW This is a fantastic opportunity for a Python Developer to join a global company that operates in a variety of industries. It is a great time to join this company because they are expanding their tech team massively and it is a chance for all developers to  have a great amount of autonomy over their own work within a large company. Not only will you be able to work on interesting projects with experienced developers, but the learning and development opportunities in this role are more than ideal for someone looking  to start a pursue a career as a software engineer. THE ROLE For this Junior Python Engineer role, you will be:  Working with Python ExtensivelyWriting clean codeDeveloping skills using cloud technologyLearning from more senior developersWorking closely with peers to define the future of the productsShaping the future of the company's tech platform across the full stack SKILLS AND EXPERTISE To qualify for this Python Developer role, you will need:  Commercial Experience with PythonCommercial Experience with cloud technologyGood communication skillsA team player attitude SALARY In this role, you could earn up to £70,000 + Benefits. HOW TO APPLY To be considered for this exciting opportunity, please submit your details using the Apply button on this page. Or for more information regarding other roles please contact Michael Bellchambers at Harnham. KEYWORDS Junior Software Engineer, Junior Python Developer, Junior Python Engineer, Python, GCP, AWS, Cloud, Docker, Kubernetes, Senior Python Developer \n",
    "skills": ""
  },
  {
    "title": "Python Developer",
    "salary": "£50,000 - £70,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Python Developer London - Hybrid £50,000 - £70,000 + Benefits This Role Does Not Provide Sponsorship OVERVIEW This is a fantastic opportunity for a Python Developer to join a global company that operates in a variety of industries. It is a great time to join this company because they are expanding their tech team massively and it is a chance for all developers to  have a great amount of autonomy over their own work within a large company. Not only will you be able to work on interesting projects with experienced developers, but the learning and development opportunities in this role are more than ideal for someone looking  to start a pursue a career as a software engineer. THE ROLE For this Junior Python Engineer role, you will be:  Working with Python ExtensivelyWriting clean codeDeveloping skills using cloud technologyLearning from more senior developersWorking closely with peers to define the future of the productsShaping the future of the company's tech platform across the full stack SKILLS AND EXPERTISE To qualify for this Python Developer role, you will need:  Commercial Experience with PythonCommercial Experience with cloud technologyGood communication skillsA team player attitude SALARY In this role, you could earn up to £70,000 + Benefits. HOW TO APPLY To be considered for this exciting opportunity, please submit your details using the Apply button on this page. Or for more information regarding other roles please contact Michael Bellchambers at Harnham. KEYWORDS Junior Software Engineer, Junior Python Developer, Junior Python Engineer, Python, GCP, AWS, Cloud, Docker, Kubernetes, Senior Python Developer \n",
    "skills": ""
  },
  {
    "title": "Python Developer",
    "salary": "£50,000 - £70,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Python Developer London - Hybrid £50,000 - £70,000 + Benefits This Role Does Not Provide Sponsorship OVERVIEW This is a fantastic opportunity for a Python Developer to join a global company that operates in a variety of industries. It is a great time to join this company because they are expanding their tech team massively and it is a chance for all developers to  have a great amount of autonomy over their own work within a large company. Not only will you be able to work on interesting projects with experienced developers, but the learning and development opportunities in this role are more than ideal for someone looking  to start a pursue a career as a software engineer. THE ROLE For this Junior Python Engineer role, you will be:  Working with Python ExtensivelyWriting clean codeDeveloping skills using cloud technologyLearning from more senior developersWorking closely with peers to define the future of the productsShaping the future of the company's tech platform across the full stack SKILLS AND EXPERTISE To qualify for this Python Developer role, you will need:  Commercial Experience with PythonCommercial Experience with cloud technologyGood communication skillsA team player attitude SALARY In this role, you could earn up to £70,000 + Benefits. HOW TO APPLY To be considered for this exciting opportunity, please submit your details using the Apply button on this page. Or for more information regarding other roles please contact Michael Bellchambers at Harnham. KEYWORDS Junior Software Engineer, Junior Python Developer, Junior Python Engineer, Python, GCP, AWS, Cloud, Docker, Kubernetes, Senior Python Developer \n",
    "skills": ""
  },
  {
    "title": "Java Developer",
    "salary": "£65,000 - £75,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Java Developer  (Greenfield) Up to £75,000 + 10% Bonus + Benefits  A privately backed global company working with some of the most successful online retailers is looking for Java Developers to join their growing team in the UK. Utilising pioneering location technology.  They are recruiting Java Developers to work on their Greenfield project working with microservices. There are no dedicated DevOps or QA engineers in the teams. All are either currently skilled or undergoing training to be able to build an entire app from scratch. The successful Java Developer will be working at pace and at scale. Utilising the latest Tech and architecture patterns. The role will involve:  Developing and designing products in a DevOps environmentUsing technology to solve problems with innovation and creativityChampioning automationEnd to end development on Java platformData driven decision making Package:  Up to £75,000 base salary10% Bonus (Paid quarterly)25 days Holiday (Increasing with service)Breakfast, Lunch and DinnerHardware budget Apply now for immediate consideration for this excellent Java Developer opportunity! Understanding Recruitment is acting as an employment agency for this Java Developer vacancy. \n",
    "skills": ""
  },
  {
    "title": "Python Developer",
    "salary": "£100,000 - £110,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Python Developer - Sports Betting Platform Salary up to £110k Python Developer (GoLang, SQL, Linux) - We are actively seeking a Python Developer to join an exciting sports betting platform. They use large datasets and a homegrown platform to predict sport as accurately as possible for the best odds  outcome as well as share information with coaches and owners of sports teams to track improvements. Our Python Developer will be working directly with the users of the software, which means collaboration with quant developers and sports traders, to take on the responsibility of improving their trading strategies and price feeds. We can offer our Python Developer:  Laid back working environment - flexible hoursExposure to a growing and diverse teamThe chance to work on frontend technologies to further expand your technical knowledge Apply immediately for consideration for this excellent Python Developer opportunity! Understanding Recruitment is acting as an employment agency for this Python Developer vacancy. \n",
    "skills": "Linux,Python,Sports,SQL,London,AWS,Betting,Hybrid,GoLang"
  },
  {
    "title": "Rust Developer",
    "salary": "USD$180,000 - USD$250,000 per annum",
    "location": "Moorgate, London\n                    London",
    "remote": "Work from home",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Rust DeveloperUp to $250,000 + Share options/ Equity/ Tokens Rust Developer - Join the market's number-one Cryptocurrency exchange. As a Rust Developer here you will set the precedent for the new-age finance industry, designing and developing cutting-edge Greenfield Rust platforms. You can work as remotely as you  like within the U.S.A or Europe - the whole team is fully remote and always will be! No need for Crypto experience at all, just an interest and good commercial experience in Rust.  You as the Rust Developer will be exposed to:  Developing a highly distributed and scalable Rust platform integrated onto AWS.Building low latency multithreaded Rust microservices systems containerised in Docker and Kubernetes.Async development work using the Tokio frameworkKafka Working alongside a tight-knit team of highly passionate, creative and forward-thinking Rust Developers. As a Rust Developer here you will be responsible for managing multiple projects from design to implementation, to deployment - writing reusable, scalable and efficient code. You will thoroughly enjoy working on the most sophisticated cryptocurrency platform  built!Reach out for a chat about this team and other Rust opportunities!  Apply for immediate consideration for this excellent Rust Developer opportunity! Understanding Recruitment is acting as an employment agency for this Rust Developervacancy. \n",
    "skills": "BDD,C++,DistributedSystems,Finance,Latency,SQL,TDD,Crypto,AWS,Docker,FinTech,Kafka,Remote,Microservices,Kubernetes,Rust"
  },
  {
    "title": ".NET Developer",
    "salary": "£35,000 - £40,000 per annum",
    "location": "London\n                    London",
    "remote": "Work from home",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         .NET Developer / C# / Software Developer / Dotnet Developer / Remote Working / Permanent Location - Remote Salary - Up to £40K DOE Permanent Calling all .NET Developers; are you looking for a new challenge? Do you have over 2 years’ commercial experience? I am looking to speak with passionate developers who are on the market for a new role. I am currently working with an award-winning software consultancy who provide services to a range of clients from SME to large organisations. This client has been established for over 10 years and due to continued success and growth, are now looking to add  a .NET Developer to the team. To be considered you will have at least 2 years commercial experience to work with top clients like Hitachi! .NET Developer Specification:  2+ years of .NET development experience using C#/.NETASP.NETWorking knowledge of GitGood communication skillsWorking knowledge of Agile SCRUM methodologies Benefits:  Flexible working hoursRemote workingExcellent opportunities for career progressionTraining and development programme If you have the desired skills and experience as a .NET Developer and would like to learn more about this opportunity, then please send me your CV and I will call you in the strictest confidence. .NET Developer / C# / Software Developer / Dotnet Developer / Remote Working / Permanent \n",
    "skills": ""
  },
  {
    "title": "Python Developer",
    "salary": "Competitive salary",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply on employer's website\n                    \n            \n    \n\n         Python Developer A global leader in technology services searching for the UK's best Python Developers. These opportunities are at all levels and as a result the client can offer both excellent professional and financial incentives for anyone to join them. About the Role As a Python Developer you will:  Select the appropriate software development tools and methodsDevelop well engineered outcomes to agreed standardsSelf-review own work and that of their colleaguesWork within a variety of disciplines from: Deigning, coding, verifying, Testing, documenting and amending programmes and integration software services. Ideal criteria for Python Developer :  A minimum of 5 years commercial experience using PythonExperience using Linux and UbuntuA seasoned backend developer experienced with large request volumes or data processing pipelinesExperience with docker and cloud infrastructure such as AWS A Python Developer will be able to avail of many perks that the firm offers as well as generous pay package as stated below:  £70,000-£90,000 base salary depending on skillset and experienceBenefits (Bonus, pension, private healtchcare etc.)Flexible Working  Due to the nature of the work the succesful candidate must either hold SC clearance or be eligible to gain SC clearance. If you would like to hear more and put your CV forward for the Python Developer role then apply directly now! \n",
    "skills": ""
  },
  {
    "title": "Java Developer",
    "salary": "£60,000 - £80,000 per annum",
    "location": "London\n                    London",
    "remote": "Work from home",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Java Developer  Hybrid Working Policy - 2 days a week in office. Salary: Up to £80k + Benefits Location: Hammersmith.  Do you want to make a difference to the holiday market with one of Europe's leading holiday provider? A leading travel planning-based company are looking to hire a Java Developer to help reduce the friction between searching for a holiday and actually booking one. Their platform allows users to find holiday packages based on what they want to do instead  of where they want to go, shaping the future of online travel. The Java Developer will:  work alongside a small team of high calibre Java developersbe involved with cutting-edge cloud infrastructuremaintain data integration softwareperformance based search and recommendation systemsrun data science models to implement real-time pricing systems. As a Java Developer you will have:  Good understanding of Algorithms and Data StructuresExperience in HTTP, Web services, and REST, Containers, cloud and LinuxTesting, reliability, and monitoringUnderstand Performance and Scalability The Java DEveloper will work with the following Tech:  JavaGoRustAWS As a Java Developer you will receive:  A clear career development path with a fast progression speed  Considerable financial contribution to your continuous professional development  Highly discounted holidays for you and your familyYou'll also be equipped with top-shelf equipment needed for the role.  25 days of annual leave + bank holidaysDiscounted gym membership at Virgin Active (right next to our offices) Apply now for immediate consideration regarding this fantastic Java Developer opportunity. Understanding Recruitment is acting as an employment agency for this vacancy \n",
    "skills": ""
  },
  {
    "title": "Java Developer",
    "salary": "£80,000 - £100,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Java Developer Cryptocurrency - (London HQ)  Salary: £100,000 + Signficant Equity  Remote From the UK  Java Developer - Join the markets leading Crypto trading platform provider, partnered with the likes of Bitcoin and XRP. The company looks to differentiate themselves through low fees, versatile funding options and rigorous security standards. You will join  some of the worlds most talented Java Developers as they revolutionise cryptocurrency. As long as you are GMT +/- 2 hours you can work as remotely as you like or come into our modern offices based in central London. You as the Java Developer will be exposed to:  Develop and maintain a backend which runs 24/7Building a low latency Java microservices system containerised in Docker and Kubernetes that continues to shape the future global Crypto exchanging market.You will have full authority to support and mentor junior colleagues and instil best practicesDevelop on a greenfield platform using JavaDeploy new databases and services with DevOps You will work across the full SDLC lifecycle, using Java as your primary language. And be surrounded by likeminded, passionate colleagues. They offer a competitive package and a fully remote working option even post Covid! Apply now for immediate consideration for this excellent Java Developer opportunity! Understanding Recruitment is acting as an employment agency for this  Java Developer vacancy! \n",
    "skills": "BDD,Java,REST,TDD,CI,SoftwareDeveloper,Cloud,AWS,CD,DevOps,LeadDeveloper,Docker,LeadSoftwareEngineer,Microservices,Kubernetes,Kotlin"
  },
  {
    "title": "Python Developer",
    "salary": "£50,000 - £70,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Python Developer London - Hybrid £50,000 - £70,000 + Benefits This Role Does Not Provide Sponsorship OVERVIEW This is a fantastic opportunity for a Python Developer to join a global company that operates in a variety of industries. It is a great time to join this company because they are expanding their tech team massively and it is a chance for all developers to  have a great amount of autonomy over their own work within a large company. Not only will you be able to work on interesting projects with experienced developers, but the learning and development opportunities in this role are more than ideal for someone looking  to start a pursue a career as a software engineer. THE ROLE For this Junior Python Engineer role, you will be:  Working with Python ExtensivelyWriting clean codeDeveloping skills using cloud technologyLearning from more senior developersWorking closely with peers to define the future of the productsShaping the future of the company's tech platform across the full stack SKILLS AND EXPERTISE To qualify for this Python Developer role, you will need:  Commercial Experience with PythonCommercial Experience with cloud technologyGood communication skillsA team player attitude SALARY In this role, you could earn up to £70,000 + Benefits. HOW TO APPLY To be considered for this exciting opportunity, please submit your details using the Apply button on this page. Or for more information regarding other roles please contact Michael Bellchambers at Harnham. KEYWORDS Junior Software Engineer, Junior Python Developer, Junior Python Engineer, Python, GCP, AWS, Cloud, Docker, Kubernetes, Senior Python Developer \n",
    "skills": ""
  },
  {
    "title": "Python Developer",
    "salary": "£75,000 - £85,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Python Developer - FinTech Risk Management Salary up to £85k plus 30% bonus and excellent benefits Python Developer (Django, Docker, AWS) - We are actively seeking a Python Developer to join our FinTech Risk Management team. They have offices in and around London with flexible remote working policy. Our Python Developer will be working on greenfield projects, refining existing systems and reporting into the Team Lead alongside four other Python Developers. Our tech stack includes: Python, Django, Docker, AWS, React. We can offer our Python Developer: · Flexible working from home policy - 2 days in the office every 2 weeks · Exposure to a growing and diverse team · Excellent salary with complementary bonuses and an education allowance to expand your knowledge We can also offer our Python Developer a welcoming environment of individuals who are passionate about technology and looking to further develop their skillset, much like yourself. Apply immediately for consideration for this excellent Python Developer opportunity! Understanding Recruitment is acting as an employment agency for this Python Developer vacancy. \n",
    "skills": "MachineLearning,Python,Robotics,Django,London,E-Commerce,AWS,AI,Hatfield,React.js"
  },
  {
    "title": "Java Developer",
    "salary": "£75,000 - £85,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Senior Java Developer  (Greenfield) Up to £85,000 + 10% Bonus + Benefits  A privately backed global company working with some of the most successful online retailers is looking for Java Developers to join their growing team in the UK. Utilising pioneering location technology.  They are recruiting Java Developers to work on their Greenfield project working with microservices. There are no dedicated DevOps or QA engineers in the teams. All are either currently skilled or undergoing training to be able to build an entire app from scratch. The successful Java Developer will be working at pace and at scale. Utilising the latest Technolagies. The role will involve:  Developing and designing products in a DevOps environmentUsing technology to solve problems with innovation and creativityChampioning automationEnd to end development on Java platformData driven decision making1pm Friday finish 2 weeks free holiday over Christmas  Package:  Up to £75,000 base salary10% Bonus (Paid quarterly)25 days Holiday (Increasing with service)Breakfast, Lunch and DinnerHardware budget Apply now for immediate consideration for this excellent Java Developer opportunity! Understanding Recruitment is acting as an employment agency for this Java Developer vacancy. \n",
    "skills": ""
  },
  {
    "title": ".NET Developer",
    "salary": "£35,000 - £45,000 per annum",
    "location": "London\n                    London",
    "remote": "Work from home",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         .NET Developer Fully Remote (London Office) £35k-£45k salary depending on experience, performance-based bonus, remote/hybrid Strong Commercial experience in .NET with C# A fast-paced big data management company with global clients is looking to expand their development team with a confident, well-rounded .NET developer. The company specialises in innovative value-adding solutions for their clients in the energy sector. In the role, you will be working as part of a tight knit development team, supporting other developers, taking responsibility for projects, contributing to data management processes, and looking for ways to improve all elements of the development cycle. To be a great fit for this .NET developer position you should have;  Strong commercial experience in .NET with C#A hard-working, can-do attitude, willing to deliver above and beyond to meet deadlinesExcellent problem-solving skills In return, the company offers;  Remote working option with London officePerformance based bonusInvestment in your development with industry training programsCompany pension scheme If you are interested in progressing your career as a .NET Developer in a fantastic long standing company that uses a vast range of the latest technologies, please feel free to contact Andrew at ISL Talent ISL (Incite Solutions Ltd) is acting as an Employment Agency in relation to this vacancy. \n",
    "skills": ""
  },
  {
    "title": "Unreal Developer",
    "salary": "£40,000 - £65,000 per annum",
    "location": "London\n                    London",
    "remote": "Work from home",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Mid-Snr Unreal Developer (x4) Location London (UK Remote) Salary £45-65k + Bens + Stock Options Skills - Unreal Engine, Unreal Developer, Games Developer, Unity, C++, Gaming, Platform development We have a superb opportunity for Unity Developers (x4) - we are working with an exciting A successful game development/ AI/ Video company that is building the next generation of media content that is revolutionizing the way we consume content online - and  we are tasked with building a new development Hub (R&D) in the UK! We are looking for Unreal engine Developers (Mid - Senior level) to build an exciting platform that allows everyone to clip their most exciting virtual moments in the game or in any metaverse scene, share it, and have others play it to create their own outcomes  and experiences - EXCITING RIGHT!! We Require   Min 3+ years of solid experience with Unreal engine developmentMinimum of 2 years of experience in developing videogames / platformsAdvantage: knowledge of Data-Oriented DesignAdvantage: experience in Unity/ C++ What you'll do:  Develop new engine runtime features and functionalitiesExtend and improve existing engine technologies  Analyze and fix common problems in a game engine such as load times, memory usage, and performance problems As a Unreal Developer you'll join a rapidly growing company as part of the NEW R&D office in UK (London). They are seeking an experienced Sr Unreal developer to be part of their core agile team of Game SDK having a direct impact on the product trajectory,  my client offers Remote working ideally with office meet up 1 day a month (London) - if you are a Unreal Developer, come and be part of a team developing the new way we share our gameplay!! \n",
    "skills": "C++,UnrealEngine"
  },
  {
    "title": "Junior Developer",
    "salary": "£35,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         JUNIOR CREATIVE DEVELOPER FOR INTERNATIONAL DIGITAL ADVERTISING AGENCY  Knowledge of HTML/ CSS/ JavaScriptWork alongside Senior Software DevelopersA well-rounded, agile, motivated, self-starterStrong desire to learnSalary up to £35,000To apply please call or email  A fantastic opportunity to kickstart your career as a Junior Developer in a dynamic digital advertising agency. You will be working in a diverse, mid-sized team of developers pushing ad-tech innovation. Sourced by: @klickstarters- helping aspiring candidates take the first step into a career in tech digital (twitter) WHO ARE WE? We are a passionate, dynamic and dedicated advertising agency trailblazing the evolution of digital marketing. We take data triggers to provide our global clients with bespoke end-to-end Dynamic Creative Organisation Services. We are looking for a motivated,  agile, self-starting Junior Developer to join our team. WHAT WILL YOU BE DOING? You will be working in our Creative Development team to build tailored ad banners to improve creative relevancy, drive footfall, drive brand lift and enhance display performance for our clients. You will be trained by a team of Senior Creative Developers  on our platforms, using HTML, CSS and JavaScript on a daily basis. WE NEED YOU TO HAVE….  Knowledge of HTML/ CSS/ JavaScriptWell-rounded and motivated self-starterPassion for creative technologyStrong desire to learnSome design experience IT'S NICE TO HAVE….  Experience with Node,jsExamples of your workPrevious experience with ad building/ working in an ad agency TO BE CONSIDERED…. Please either apply by clicking online or emailing me directly to . For further information please call me on or . I can make myself available outside of normal working hours to suit from 7am until 10pm. If unavailable, please leave a message and either  myself or one of my colleagues will respond. By applying for this role, you give express consent for us to process & submit (subject to required skills) your application to our client in conjunction with this vacancy only. Also feel free to follow me on Twitter @klickstartersAb or connect with me on LinkedIn, just search Abbey Humphreys in Google! I look forward to hearing from you \n",
    "skills": "HTML/CSS/JavaScript"
  },
  {
    "title": ".NET Developer",
    "salary": "£110,000 - £130,000 per annum",
    "location": "City of London\n                    London",
    "remote": "Work from home",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         .NET Developer - Global Phenomenon - London (Tech stack: .NET Developer, .NET 7, C#, Azure, Angular 14, Multithreading, RESTful, Web API 2, JavaScript, Programmer, Full Stack Engineer, Architect, .NET Developer) Our client has created a global phenomenon, connecting people online to unique travel experiences, in more than 60'000 cities and 180 countries. As they approach their 10th anniversary they are looking to produce a revolutionary set of products and services  that will transform the travel industry beyond recognition. For our client, engineering isn't just a job but a practice that they want to perfect. They aim to keep their systems modular, their code clean, and their documentation clear, and they follow the idea of leaving things better than how you found it. It's  not just about the code - putting the right processes and tools in place to make developers happy and efficient is important to our client because it gives their .NET Developer the time to focus on polishing the product. Working on a new payment solution, you will be given the opportunity to operate at all levels of the stack: the UIs that allow people all over the world to pay and get paid in their locally preferred methods, the APIs and processor integrations to send payment  instructions to their wide network of partners, the offline reporting and reconciliation pipelines that ensure financial data integrity and allow the business to operate, and more. We are seeking .NET Developer with a strong grasp of object orientated development principles and sound knowledge of: .NET, .NET Core / ASP.NET MVC, C# and SQL Server. You will receive industry recognized training in all aspects of: .NET 7, Azure, Angular  14, Solid, DRY, LINQ, multithreading, Microservices, RESTful, Web API 2, JavaScript, HTML5, Agile and SQL Server 2022. Our client offers a structured career progression programme. It's common place for developers within their firm to receive their first promotion (and pay rise!) within 6 months of joining. All positions come with the following benefits:  Company sharesBonus (typically 20%)Pension (11%)Private medical healthcare (family plan included)27 days holidayQuarterly employee travel couponCommunity involvement (4 hours per month to give back to the community)Much more... No global movement springs from individuals. It takes an entire team united behind something big. Together, they work hard, they laugh a lot, they brainstorm nonstop, they use hundreds of Post-Its a week, and they give the best high-fives in town. If you  are interested in being a part of this movement please apply today! Location: London, UK / Remote Working Salary: £110,000 - £130,000 + Bonus + Pension + Benefits Noir continues to be the leading Microsoft recruitment agency; we can help you make the right career decisions! NOIRUKNETRECNOIRUKREC \n",
    "skills": ""
  },
  {
    "title": "Java Developer",
    "salary": "£100,000 - £130,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Lead Java Developer Developer Salary up to £130,000 + uncapped bonus Hyrbrid working pattern (1-2 days in the London office) We currently have the pleasure of working with an exciting tech start-up within the foreign exchange market, who are looking to build a robust greenfield trading platform which will be processing up to 5 billion trade messages per day. It has been just over  5 years since they came to market and have grown from strength to strength with every financial year. Responsibilities as a Lead Java Developer:  As a Lead Developer you will be responsible for the development of high-performance, low-latency, mission critical software at the heart of the trading software.You will need take a holistic view interest in Software Development and practised in multiple programming/scripting languages.You will assist in architecting aspects of the trading platform, working closely with peers, front-end/mobile developers, product management, QA, and UX/UIAs a Lead Java Developer, you will be expected to lead small product teams, mentor and train mid-level developers and then present progress to key stakeholders. Please just some of the tools you will be exposed to within this position:  Java 8+DockerKubernetesMySqlMultithreaded programmingREST API and Web-Sockets Not only will you have access to an extremely competitive salary in this space, you will have access to an uncapped bonus (some developers received up-to 40% last year) you will also be given an extensive list of useful perks/benefits. If you have exposure to working as a Lead Java Developer within a fast pace high-latency environment and are looking to leave your mark within a brand new,cutting edge project then please reach to myself or apply below immediately! \n",
    "skills": "Developer,Java,Software,Spring,Trading,LowLatency,Multithreading,Engineer,Back-End,Microservices"
  },
  {
    "title": "Python Developer",
    "salary": "£55,000 - £70,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Python Developer London - Hybrid £55,000 - £75,000 + Benefits This Role Does Not Provide Sponsorship OVERVIEW This is a fantastic opportunity for a Python Developer to join a global company that operates in a variety of industries. It is a great time to join this company because they are expanding their tech team massively and it is a chance for all developers to  have a great amount of autonomy over their own work within a large company. Not only will you be able to work on interesting projects with experienced developers, but the learning and development opportunities in this role are more than ideal for someone looking  to start a pursue a career as a software engineer. THE ROLE For this Junior Python Engineer role, you will be:  Working with Python ExtensivelyWriting clean codeDeveloping skills using cloud technologyLearning from more senior developersWorking closely with peers to define the future of the productsShaping the future of the company's tech platform across the full stack SKILLS AND EXPERTISE To qualify for this Python Developer role, you will need:  Commercial Experience with PythonCommercial Experience with cloud technologyGood communication skillsA team player attitude SALARY In this role, you could earn up to £70,000 + Benefits. HOW TO APPLY To be considered for this exciting opportunity, please submit your details using the Apply button on this page. Or for more information regarding other roles please contact Michael Bellchambers at Harnham. KEYWORDS Junior Software Engineer, Junior Python Developer, Junior Python Engineer, Python, GCP, AWS, Cloud, Docker, Kubernetes, Senior Python Developer \n",
    "skills": ""
  },
  {
    "title": "Rust Developer",
    "salary": "USD$180,000 - USD$250,000 per annum",
    "location": "Moorgate, London\n                    London",
    "remote": "Work from home",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Rust DeveloperUp to $250,000 + Share options Rust Developer - Join the market's number-one Cryptocurrency exchange. As a Rust Developer here you will set the precedent for the new-age finance industry, designing and developing cutting-edge Greenfield Rust platforms. You can work as remotely as you  like within the U.S.A or Europe - the whole team is fully remote and always will be! No need for Crypto experience at all, just an interest and good commercial experience in Rust.  You as the Rust Developer will be exposed to:  Developing a highly distributed and scalable Rust platform integrated onto AWS.Building low latency multithreaded Rust microservices systems containerised in Docker and Kubernetes.Async development work using the Tokio frameworkKafka Working alongside a tight-knit team of highly passionate, creative and forward-thinking Rust Developers. As a Rust Developer here you will be responsible for managing multiple projects from design to implementation, to deployment - writing reusable, scalable and efficient code. You will thoroughly enjoy working on the most sophisticated cryptocurrency platform  built!Reach out for a chat about this team and other Rust opportunities!  Apply for immediate consideration for this excellent Rust Developer opportunity! Understanding Recruitment is acting as an employment agency for this Rust Developervacancy. \n",
    "skills": "BDD,C++,DistributedSystems,Finance,Latency,SQL,TDD,Crypto,AWS,Docker,FinTech,Kafka,Remote,Microservices,Kubernetes,Rust"
  },
  {
    "title": "Umbraco Developer",
    "salary": "£50,000 - £75,000 per annum",
    "location": "London\n                    London",
    "remote": "",
    "type": "Permanent, full-time",
    "description": "\n\n    \n            \n                        \n                    \n                        Apply now\n                    \n            \n    \n\n         Umbraco Developer with strong C# - Fully Remote An Umbraco Developer with strong C# is required by a leading Media Entertainment company. The Developer will be joining an ever-growing team, building innovative digital solutions that have inspired and disrupted the market.  Technology is at the heart of what they do, therefore wise investments are always being made in R&D innovation and smart people. As a tech savvy Software craftsman, you must have a deep understanding of SOLID principles, understand object-oriented programming and appreciate the Agile development way of working. All developers are encouraged to assist in innovation of the software development practices. You will be a .NET C# Developer with competent level of experience in development of digital software using Umbraco, .NET Core, MVC, HTML5, CSS3, JavaScript, Angular/React, SQL Server and Agile.  The ideal person will be an ambitious developer looking to get in to technical architecture who enjoys leading by example and being involved in technical innovation. Excellent benefits, competitive salary, training provided, learning Sitecore and work fully remote. \n",
    "skills": ""
  }
]